In [3]:
import pandas
data = pandas.read_csv('data/titanic.csv', index_col='PassengerId')

In [4]:
data[:10]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [5]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
data['Pclass']

PassengerId
1      3
2      1
3      3
4      1
5      3
6      3
7      1
8      3
9      3
10     2
11     3
12     1
13     3
14     3
15     3
16     2
17     3
18     2
19     3
20     3
21     2
22     2
23     3
24     1
25     3
26     3
27     3
28     1
29     3
30     3
      ..
862    2
863    1
864    3
865    2
866    2
867    2
868    1
869    3
870    3
871    3
872    1
873    1
874    3
875    2
876    3
877    3
878    3
879    3
880    1
881    2
882    3
883    3
884    2
885    3
886    3
887    2
888    1
889    3
890    1
891    3
Name: Pclass, dtype: int64

In [7]:


data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [8]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [9]:
data.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
data['Survived'].value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [11]:
data.count()

Survived    891
Pclass      891
Name        891
Sex         891
Age         714
SibSp       891
Parch       891
Ticket      891
Fare        891
Cabin       204
Embarked    889
dtype: int64

In [12]:
round(data['Survived'].value_counts()[1] / float(data['Survived'].count()) * 100, 2)

38.38

In [13]:
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [14]:
round(data['Pclass'].value_counts()[1] / float(data['Pclass'].count()) * 100, 2)

24.24

In [15]:
data['Age'].mean(axis=0)

29.69911764705882

In [16]:
data['Age'].median(axis=0)

28.0

In [20]:
data['SibSp'].corr(data['Parch'])

0.41483769862015579

In [171]:
data['Name'].where(data['Sex'] == 'female').str.extract('(?<=\()(?P<name>\w+)\s', expand=False).value_counts()

Elizabeth     6
Anna          5
Maria         4
Margaret      4
Mary          4
Ada           4
Florence      3
Edith         3
Jane          3
Martha        2
Alice         2
Catherine     2
Marie         2
Charlotte     2
Lily          2
Emily         2
Johanna       2
Elisabeth     2
Clara         2
Miriam        1
Lucille       1
Myna          1
Amelia        1
Helen         1
Vera          1
Juliette      1
Elna          1
Rosalie       1
Eliza         1
Sylvia        1
             ..
Mantoura      1
Elin          1
Latifa        1
Bertha        1
Hannah        1
Adele         1
Emelia        1
Margaretta    1
Dorothy       1
Bessie        1
Alfrida       1
Lucy          1
Edwiga        1
Grace         1
Lulu          1
Amy           1
Hanne         1
Lilian        1
Alma          1
Marian        1
Lillian       1
Cordelia      1
Irene         1
Augusta       1
Leila         1
Lutie         1
Annie         1
Sallie        1
Madeleine     1
Jessie        1
Name: name, dtype: int64

In [176]:
data['Name'].where(data['Sex'] == 'female').str.extract('(?<=M[is|r]s\.\s)(?P<name>\w+)(?!.*\()', expand=False)

PassengerId
1         NaN
2         NaN
3         NaN
4         NaN
5         NaN
6         NaN
7         NaN
8         NaN
9         NaN
10        NaN
11        NaN
12        NaN
13        NaN
14        NaN
15        NaN
16        NaN
17        NaN
18        NaN
19        NaN
20     Fatima
21        NaN
22        NaN
23        NaN
24        NaN
25        NaN
26        NaN
27        NaN
28        NaN
29        NaN
30        NaN
        ...
862       NaN
863       NaN
864       NaN
865       NaN
866       NaN
867       NaN
868       NaN
869       NaN
870       NaN
871       NaN
872       NaN
873       NaN
874       NaN
875       NaN
876       NaN
877       NaN
878       NaN
879       NaN
880       NaN
881       NaN
882       NaN
883       NaN
884       NaN
885       NaN
886       NaN
887       NaN
888       NaN
889       NaN
890       NaN
891       NaN
Name: name, dtype: object

In [124]:
data['Name'].where(data['Sex'] == 'female').str.extract('(?<=\()(?P<name>\w+)\s', expand=False).merge(
    data['Name'].where(data['Sex'] == 'female').str.extract('(?<=[Miss|Mrs\.\s])(?P<name>\w+)\s', expand=False))

AttributeError: 'Series' object has no attribute 'merge'

In [135]:
data['Name'].where(data['Sex'] == 'female')

PassengerId
1                                                    NaN
2      Cumings, Mrs. John Bradley (Florence Briggs Th...
3                                 Heikkinen, Miss. Laina
4           Futrelle, Mrs. Jacques Heath (Lily May Peel)
5                                                    NaN
6                                                    NaN
7                                                    NaN
8                                                    NaN
9      Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
10                   Nasser, Mrs. Nicholas (Adele Achem)
11                       Sandstrom, Miss. Marguerite Rut
12                              Bonnell, Miss. Elizabeth
13                                                   NaN
14                                                   NaN
15                  Vestrom, Miss. Hulda Amanda Adolfina
16                      Hewlett, Mrs. (Mary D Kingcome)
17                                                   NaN
18                                                   NaN
19     Vander Planke, Mrs. Julius (Emelia Maria Vande...
20                               Masselmani, Mrs. Fatima
21                                                   NaN
22                                                   NaN
23                           McGowan, Miss. Anna "Annie"
24                                                   NaN
25                         Palsson, Miss. Torborg Danira
26     Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
27                                                   NaN
28                                                   NaN
29                         O'Dwyer, Miss. Ellen "Nellie"
30                                                   NaN
                             ...
862                                                  NaN
863    Swift, Mrs. Frederick Joel (Margaret Welles Ba...
864                    Sage, Miss. Dorothy Edith "Dolly"
865                                                  NaN
866                             Bystrom, Mrs. (Karolina)
867                         Duran y More, Miss. Asuncion
868                                                  NaN
869                                                  NaN
870                                                  NaN
871                                                  NaN
872     Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
873                                                  NaN
874                                                  NaN
875                Abelson, Mrs. Samuel (Hannah Wizosky)
876                     Najib, Miss. Adele Kiamie "Jane"
877                                                  NaN
878                                                  NaN
879                                                  NaN
880        Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
881         Shelley, Mrs. William (Imanita Parrish Hall)
882                                                  NaN
883                         Dahlberg, Miss. Gerda Ulrika
884                                                  NaN
885                                                  NaN
886                 Rice, Mrs. William (Margaret Norton)
887                                                  NaN
888                         Graham, Miss. Margaret Edith
889             Johnston, Miss. Catherine Helen "Carrie"
890                                                  NaN
891                                                  NaN
Name: Name, dtype: object